florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // Initialize centralized touch handler
    touch::init();

    // Apply saved configuration
    {
        const auto& cfg = config_store::get();
        // Traction mode is now read from physical switch, not NVS
        currentModeFlags   = traction_sw::getModeFlag()
                           | (cfg.driveMode & can::MODE_FLAG_TANK_TURN);
        frontLedLocalState = cfg.frontLedEnabled;
        rearLedLocalState  = cfg.rearLedEnabled;

        // Apply saved audio volume to DFPlayer
        audio::setVolume(cfg.audioVolume);
        lastAppliedAudioVolume = cfg.audioVolume;

        // Populate vehicleData with initial mode flags
        vehicle::ModeData md;
        md.modeFlags   = currentModeFlags;
        md.timestampMs = millis();
        vehicleData.setMode(md);
    }

    // Create render task on Core 0 — offloads all TFT and touch operations
    // from the main loop, preventing SPI blocking on Core 1.
    vdMutex = xSemaphoreCreateMutex();
    touchActionQueue = xQueueCreate(8, sizeof(TouchAction));
    if (vdMutex == nullptr || touchActionQueue == nullptr) {
        Serial.println("[BOOT][ERR] Failed to create render task resources");
        // Fall through — render task won't be created, TFT won't update.
        // System is still safe (CAN, safety, LEDs continue on Core 1).
    } else {
        BaseType_t rc = xTaskCreatePinnedToCore(
            renderTask, "Render", 16384, nullptr, 1, &renderTaskHandle, 0);
        if (rc != pdPASS) {
            Serial.println("[BOOT][ERR] Failed to create render task");
        } else {
            Serial.println("[BOOT][INFO] Render task started on Core 0");
        }
    }
}

// ---------------------------------------------------------------------------
// loop() — called repeatedly
// ---------------------------------------------------------------------------
void loop() {
    RTMON_LOOP_BEGIN();
    unsigned long now = millis();

    // R-3 hardening: emit stack high-watermark for both FreeRTOS tasks
    // every 5 s.  Pure instrumentation — uxTaskGetStackHighWaterMark
    // is non-blocking and reports the minimum free stack (in words on
    // ESP-IDF FreeRTOS) seen since task creation.  No stack sizes are
    // changed; this only makes silent overflow risk observable.
    {
        static uint32_t s_lastStackHwmLogMs = 0;
        if ((now - s_lastStackHwmLogMs) >= 5000UL) {
            s_lastStackHwmLogMs = now;
            UBaseType_t loopHwm   = uxTaskGetStackHighWaterMark(nullptr);
            UBaseType_t renderHwm = (renderTaskHandle != nullptr)
                                  ? uxTaskGetStackHighWaterMark(renderTaskHandle)
                                  : 0;
            Serial.printf("[STACK] loop_hwm=%u render_hwm=%u\n",
                          (unsigned)loopHwm, (unsigned)renderHwm);
        }
    }

    // Poll CAN RX and decode incoming frames
    RTMON_CAN_BEGIN();
    can_rx::poll(vehicleData);
    RTMON_CAN_END();

    // Check for pending ACK (non-blocking)
    ackCheck(vehicleData);

    // ---- Sync mode flags from STM32 heartbeat echo ----
    // The STM32 echoes the active mode flags in the heartbeat status_flags
    // (bits 1-2).  This allows the ESP32 to confirm the STM32 actually
    // applied the requested mode, even if the ACK was lost.
    // §1 CAN state validation: this is the SOLE source of truth for UI mode
    // state.  Tank turn and traction toggles only send CAN commands — the UI
    // updates here after the STM32 confirms via heartbeat echo.
    // Guard: only sync after first valid heartbeat has been received
    // (timestampMs is 0 until the first CAN heartbeat is decoded).
    {
        const auto& hb = vehicleData.heartbeat();
        if (hb.timestampMs > 0) {
            uint8_t confirmedFlags = (hb.statusFlags >> 1) & 0x03;
            if (confirmedFlags != currentModeFlags) {
                currentModeFlags = confirmedFlags;
                vehicle::ModeData md;
                md.modeFlags   = currentModeFlags;
                md.timestampMs = millis();
                vehicleData.setMode(md);
                // Persist confirmed tank turn state to NVS
                config_store::setDriveMode(currentModeFlags & can::MODE_FLAG_TANK_TURN);
            }
        }
    }

    // ---- STM32 heartbeat liveness monitoring (SAFETY FIX) ----
    // Verify the STM32 alive counter is incrementing each heartbeat period.
    // A frozen STM32 (timer ISR alive but main loop stuck) would send the same
    // counter value indefinitely — treat it as non-responsive after the freeze
    // threshold and inhibit further motion commands from this node.
    {
        const auto& hb = vehicleData.heartbeat();
        if (hb.timestampMs > 0) {
            uint8_t counter = hb.aliveCounter;
            if (counter != stm32HbLastCounter) {
                stm32HbLastCounter = counter;
                stm32HbSameCount   = 0;
                stm32IsAlive       = true;
            } else {
                if (stm32HbSameCount < STM32_HB_FREEZE_COUNT) {
                    stm32HbSameCount++;
                }
                stm32IsAlive = (stm32HbSameCount < STM32_HB_FREEZE_COUNT);
                if (!stm32IsAlive) {
                    Serial.println("[SAFETY][WARN] STM32 heartbeat counter frozen — inhibiting commands");
                }
            }

            // ---- Gear re-sync after STM32 restart (SAFETY FIX) ----
            // Detect startup_inhibit bit (statusFlags bit 0): 0→1 = STM32 just restarted.
            // When the bit later clears (0) AND state is ACTIVE, re-send the current gear
            // so the STM32 and shifter are synchronised.  Guards against the default
            // GEAR_FORWARD mis-match if the driver had previously selected PARK or REVERSE.
            bool startupInhibitNow = (hb.statusFlags & 0x01u) != 0;
            if (startupInhibitNow && !stm32StartupSeen) {
                // Rising edge of startup_inhibit → STM32 just booted/reset
                stm32StartupSeen    = true;
                gearResyncPending   = true;
                tempMapResyncPending = true;
                Serial.println("[SAFETY][INFO] STM32 restart detected — gear + temp-map resync pending");
            }
            if (gearResyncPending && !startupInhibitNow &&
                hb.systemState == can::SystemState::ACTIVE && stm32IsAlive) {
                // STM32 is now in ACTIVE with no startup inhibit — send current gear
                uint8_t curGear = shifter::getGearRaw();
                sendGearCommand(curGear);
                lastSentGear    = curGear;  // prevent duplicate send from shifter loop
                gearResyncPending = false;
                Serial.printf("[SAFETY][INFO] Gear resync sent: gear=%u\n", curGear);
            }
            // Re-send the DS18B20 physIdx→role mapping after STM32 restart so
            // the STM32's in-RAM map matches the user's saved assignment.
            // Sent in STANDBY or ACTIVE (STM32 can receive it in either state).
            if (tempMapResyncPending && !startupInhibitNow && stm32IsAlive) {
                const auto& cfg = config_store::get();
                CanFrame frame = {};
                frame.identifier       = can::CMD_SENSOR_MAP_TEMP;
                frame.extd             = 0;
                frame.data_length_code = config_store::NUM_TEMP_SENS;
                for (uint8_t i = 0; i < config_store::NUM_TEMP_SENS; ++i) {
                    frame.data[i] = cfg.tempSensorMap[i];
                }
                ESP32Can.writeFrame(frame, 0);
                tempMapResyncPending = false;
                Serial.println("[SAFETY][INFO] DS18B20 sensor map resync sent to STM32");
            }
            if (!startupInhibitNow) {
                stm32StartupSeen = false;  // inhibit cleared, ready for next detection
            }
        }
    }

    // Update obstacle sensor and transmit CAN 0x208
    {
        // Compute average vehicle speed (0.1 km/h units → km/h)
        uint32_t speedSum = 0;
        for (uint8_t i = 0; i < 4; ++i) {
            speedSum += vehicleData.speed().raw[i];
        }
        float speedKmh = static_cast<float>(speedSum) / 4.0f * 0.1f;
        obstacle_sensor::update(speedKmh);
        can_obstacle::update();

        // Update VehicleData with latest sensor reading for HMI display.
        // distanceCm = 0 maps to "---" in the UI, signalling no valid reading.
        // Use 0 when the sensor is unhealthy (fault/stuck/timeout) so the
        // display shows "---" instead of a misleading "0.02 m" fallback value.
        obstacle_sensor::Reading rd = obstacle_sensor::getReading();
        vehicle::ObstacleData od;
        od.distanceCm  = rd.healthy ? (rd.distance_mm / 10) : 0;
        od.timestampMs  = millis();
        vehicleData.setObstacle(od);
    }

    // ---- Update shared vehicle data for render task (Core 0) ----
    // Non-blocking: skip if render task holds the mutex (stale-by-one-frame is OK).
    if (vdMutex != nullptr && xSemaphoreTake(vdMutex, 0) == pdTRUE) {
        renderVD = vehicleData;
        xSemaphoreGive(vdMutex);
    }

