florinzgz/STM32-Control-Coche-Marcos/esp32/src/main.cpp
    // Poll iBUS parser (no-op only when REMOTE_CONTROL_ENABLED=0) and compute
    // unified LOCAL/REMOTE arbitration gates for all RC-driven subsystems.
    remote_control::update();
    const bool remoteAuthorityActive =
        stm32IsAlive &&
        remote_control::isRemoteSelected() &&
        remote_control::getState() == remote_control::State::ACTIVE;
    const bool remoteMotionAuthorityActive =
        remoteAuthorityActive && !remote_control::isKillSwitchActive();

    // ---- Shifter gear update ----
    // Poll shifter + RC CH7 and send CAN 0x102 on authoritative source change.
    {
        shifter::update();
        uint8_t gear = remoteMotionAuthorityActive
                     ? remote_control::getRequestedGear()
                     : shifter::getGearRaw();
        if (gear != lastSentGear &&
            (now - lastGearSendMs) >= GEAR_SEND_DEBOUNCE_MS &&
            stm32IsAlive) {
            lastSentGear   = gear;
            lastGearSendMs = now;
            sendGearCommand(gear);
            // Play specific gear announcement
            switch (static_cast<shifter::Gear>(gear)) {
                case shifter::Gear::PARK:       audio::play(audio::Sound::GEAR_PARK,    audio::Priority::LO); break;
                case shifter::Gear::REVERSE:    audio::play(audio::Sound::GEAR_REVERSE, audio::Priority::LO); break;
                case shifter::Gear::NEUTRAL:    audio::play(audio::Sound::GEAR_NEUTRAL, audio::Priority::LO); break;
                case shifter::Gear::FORWARD:    audio::play(audio::Sound::GEAR_D1,      audio::Priority::LO); break;
                case shifter::Gear::FORWARD_D2: audio::play(audio::Sound::GEAR_D2,      audio::Priority::LO); break;
            }
            Serial.printf(remoteMotionAuthorityActive
                              ? "[REMOTE] Gear(CH7) → %u\n"
                              : "[SHIFTER] Gear → %u\n",
                          gear);
        }
    }

    // ---- Traction switch update ----
    // Poll DPDT rocker switch for 2WD/4WD selection.
    // CAN CMD_MODE is sent only when the switch state changes.
    // Speed gate is handled internally by traction_sw::update().
    {
        // Compute average vehicle speed (0.1 km/h units → km/h)
        uint32_t swSpeedSum = 0;
        for (uint8_t i = 0; i < 4; ++i) {
            swSpeedSum += vehicleData.speed().raw[i];
        }
        float swSpeedKmh = static_cast<float>(swSpeedSum) / 4.0f * 0.1f;

        traction_sw::update(swSpeedKmh);

        if (remoteMotionAuthorityActive) {
            uint8_t remoteModeFlags = remote_control::getDriveMode();
            if (remoteModeFlags != currentModeFlags && stm32IsAlive) {
                currentModeFlags = remoteModeFlags;
                sendModeCommand(currentModeFlags);
                vehicle::ModeData md;
                md.modeFlags   = currentModeFlags;
                md.timestampMs = millis();
                vehicleData.setMode(md);
                Serial.printf("[REMOTE] Mode(CH6) → flags=0x%02X\n", currentModeFlags);
            }
        } else if (traction_sw::hasChanged() && stm32IsAlive) {
            // Update mode flags: preserve tank turn bit, set 4x4 from switch
            uint8_t tractionBit = traction_sw::getModeFlag();
            currentModeFlags = (currentModeFlags & can::MODE_FLAG_TANK_TURN)
                             | tractionBit;
            sendModeCommand(currentModeFlags);
            // NVS persist deferred to heartbeat sync (§1) — only confirmed
            // state is persisted to avoid stale data on power loss.
            {
                vehicle::ModeData md;
                md.modeFlags   = currentModeFlags;
                md.timestampMs = millis();
                vehicleData.setMode(md);
            }
            // Play traction audio feedback
            if (traction_sw::is4WD()) {
                audio::play(audio::Sound::TRACTION_4X4, audio::Priority::LO);
            } else {
                audio::play(audio::Sound::TRACTION_4X2, audio::Priority::LO);
            }
            Serial.printf("[TRACTION] Switch → %s, flags=0x%02X\n",
                          traction_sw::is4WD() ? "4WD" : "2WD",
                          currentModeFlags);
            traction_sw::clearChanged();
        }
    }

    // ---- Process touch actions from render task (Core 0) ----
    // Touch reading and screen dispatch happen on Core 0 (same SPI bus as TFT).
    // Actions that require CAN sends or state changes are queued here.
    if (touchActionQueue != nullptr) {
        TouchAction act;
        while (xQueueReceive(touchActionQueue, &act, 0) == pdTRUE) {
            switch (act) {
                case TouchAction::FRONT_LED_TOGGLE:
                    if (remoteAuthorityActive) break;
                    frontLedLocalState = !frontLedLocalState;
                    sendLedCommand(frontLedLocalState, rearLedLocalState);
                    config_store::setFrontLedEnabled(frontLedLocalState);
                    audio::play(frontLedLocalState ? audio::Sound::LIGHTS_ON
                                                   : audio::Sound::LIGHTS_OFF,
                                audio::Priority::LO);
                    Serial.printf("[LED] Front → %s\n",
                                  frontLedLocalState ? "ON" : "OFF");
                    break;

                case TouchAction::REAR_LED_TOGGLE:
                    if (remoteAuthorityActive) break;
                    rearLedLocalState = !rearLedLocalState;
                    sendLedCommand(frontLedLocalState, rearLedLocalState);
                    config_store::setRearLedEnabled(rearLedLocalState);
                    audio::play(rearLedLocalState ? audio::Sound::LIGHTS_ON
                                                  : audio::Sound::LIGHTS_OFF,
                                audio::Priority::LO);
                    Serial.printf("[LED] Rear → %s\n",
                                  rearLedLocalState ? "ON" : "OFF");
                    break;

                case TouchAction::TANK_MODE_TOGGLE:
                    if (stm32IsAlive && !remoteAuthorityActive) {
                        currentModeFlags ^= can::MODE_FLAG_TANK_TURN;
                        audio::play(audio::Sound::BEEP, audio::Priority::LO);
                        sendModeCommand(currentModeFlags);
                        // §1 CAN state validation: do NOT update vehicleData here.
                        // The heartbeat sync (lines 693-700) updates UI state
                        // ONLY after the STM32 confirms via statusFlags echo.
                        // NVS persistence also deferred to heartbeat confirmation.
                        Serial.printf("[MODE] Tank toggle requested → 0x%02X\n",
                                      currentModeFlags);
                    }
                    break;
            }
        }

